src/conf/DataProcessors/уп_ГрафикСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>уп_ГрафикСотрудников</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/conf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОказываемыеПроцедуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/conf/DataProcessors/уп_ГрафикСотрудников/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Если Справочники.Организации.КоличествоОрганизаций() = 1 Тогда
		Элементы.Организация.Видимость = Ложь;   
	КонецЕсли;	
	
	ГрафикРаботы = ТекущаяДата();
	
	ЗаполнитьДаннымиТекущегоГода();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.ГрафикРаботы.НачалоПериодаОтображения = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРаботыПриВыводеПериода(Элемент, ОформлениеПериода)
		Для Каждого СтрокаОформленияПериода Из ОформлениеПериода.Даты Цикл
		Если ДниГрафика.Получить(СтрокаОформленияПериода.Дата) = Неопределено Тогда
			ЦветТекстаДня = ОбщегоНазначенияКлиент.ЦветСтиля("ВидДняПроизводственногоКалендаряНеУказанЦвет");
		Иначе
			ЦветТекстаДня = ОбщегоНазначенияКлиент.ЦветСтиля("ВидДняПроизводственногоКалендаряРабочийЦвет");
		КонецЕсли;
		СтрокаОформленияПериода.ЦветТекста = ЦветТекстаДня;
		// Ручное редактирование
		//Если ДниИзмененные.Получить(СтрокаОформленияПериода.Дата) = Неопределено Тогда
			ЦветФонаДня = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветФонаПоля");
		//Иначе
		//	ЦветФонаДня = ОбщегоНазначенияКлиент.ЦветСтиля("ДатаГрафикаИзмененнаяФон");
		//КонецЕсли;
		СтрокаОформленияПериода.ЦветФона = ЦветФонаДня;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиТекущегоГода(ЗначениеКопирования = Неопределено)
	
	// Заполняет форму данными текущего года.
	
//	НастроитьПолеКалендаря();
	
//	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
//		ГрафикСсылка = ЗначениеКопирования;
//	Иначе
//		ГрафикСсылка = Объект.Ссылка;
//	КонецЕсли;
	
	ДниГрафика = Новый ФиксированноеСоответствие(
		Справочники.Сотрудники.ПрочитатьДанныеГрафикаИзРегистра(Объект.Сотрудник, НачалоГода(ТекущаяДата()), КонецГода(ТекущаяДата())));

	//ПрочитатьПризнакРучногоРедактирования(Объект, НомерТекущегоГода);
	//
	//// Если нет ручных корректировок и данных тоже нет, то формируем результат по шаблону за выбранный год.
	//Если ДниГрафика.Количество() = 0 И ДниИзмененные.Количество() = 0 Тогда
	//	ДниВключенныеВГрафик = Справочники.Календари.ДниВключенныеВГрафик(
	//								Объект.ДатаНачала, 
	//								Объект.СпособЗаполнения, 
	//								Объект.ШаблонЗаполнения, 
	//								Дата(НомерТекущегоГода, 12, 31),
	//								Объект.ПроизводственныйКалендарь, 
	//								Объект.УчитыватьПраздники, 
	//								Объект.ДатаОтсчета);
	//	ДниГрафика = Новый ФиксированноеСоответствие(ДниВключенныеВГрафик);
	//КонецЕсли;
	//
	//УстановитьСнятьМодифицированностьРезультата(ЭтотОбъект, Ложь);
	//УстановитьСнятьПризнакСоответствияРезультатовШаблону(ЭтотОбъект, Не МодифицированностьШаблона);

КонецПроцедуры


&НаКлиенте
Процедура ГрафикРаботыПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ЗаполнитьДаннымиТекущегоГода();
	Элементы.ГрафикРаботы.Обновить();

КонецПроцедуры


&НаКлиенте
Процедура ГрафикРаботыВыбор(Элемент, ВыбраннаяДата)
		Если ДниГрафика.Получить(ВыбраннаяДата) = Неопределено Тогда
		// Включаем в график
		ГрафикиРаботыКлиентСервер.ВставитьВФиксированноеСоответствие(ДниГрафика, ВыбраннаяДата, Истина);
		ДеньВключенВГрафик = Истина;
	Иначе
		// Исключаем из графика
		ГрафикиРаботыКлиентСервер.УдалитьИзФиксированногоСоответствия(ДниГрафика, ВыбраннаяДата);
		ДеньВключенВГрафик = Ложь;
	КонецЕсли;
		
	Элементы.ГрафикРаботы.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	Справочники.Сотрудники.ЗаписатьДанныеГрафикаВРегистр(Объект.Сотрудник, ДниГрафика, НАчалоГода(ТекущаяДата()), КонецГода(ТекущаяДата()));
КонецПроцедуры
